Revit 2027 API
ProfileFailures Properties
The BuiltInFailures.ProfileFailures type exposes the following members.
Properties
Name | Description
SketchNotEmpty |  Can't move the Profile Plane because the Profile Sketch is not empty. This operation is not supported at this time.
Top
See Also
Reference
BuiltInFailures.ProfileFailures Class
Autodesk.Revit.DB Namespace